In [1]:
import pandas as pd

In [26]:
df1=pd.DataFrame({'A':[1,2,3],
                  'B':[10,20,30]},index=['a','b','c'])
df2=pd.DataFrame({'C':[4,5],
                  'D':[40,50]},index=['a','b'])
display(df1,df2)

   A   B
a  1  10
b  2  20
c  3  30

   C   D
a  4  40
b  5  50

In [23]:
df1.join(df2)

   A   B  C   D
a  1  10  4  40
b  2  20  5  50
c  3  30  6  60

In [24]:
df2.join(df1)#if index of dataframes df1 snd df2 are differnt then they will join but the values of df1 will show NaN

   C   D  A   B
a  4  40  1  10
b  5  50  2  20
c  6  60  3  30

In [25]:
df2.join(df1)

   C   D  A   B
a  4  40  1  10
b  5  50  2  20
c  6  60  3  30

In [28]:
df1.join(df2)

   A   B    C     D
a  1  10  4.0  40.0
b  2  20  5.0  50.0
c  3  30  NaN   NaN

In [29]:
df1.join(df2,how='right')#it will print according to the right df

   A   B  C   D
a  1  10  4  40
b  2  20  5  50

In [30]:
df1.join(df2,how='inner')

   A   B  C   D
a  1  10  4  40
b  2  20  5  50

In [31]:
df1.join(df2,how='outer')

   A   B    C     D
a  1  10  4.0  40.0
b  2  20  5.0  50.0
c  3  30  NaN   NaN

In [32]:
df1=pd.DataFrame({'A':[1,2,3],
                  'B':[10,20,30]},index=['a','b','c'])
df2=pd.DataFrame({'A':[4,5],
                  'D':[40,50]},index=['a','b'])
display(df1,df2)

   A   B
a  1  10
b  2  20
c  3  30

   A   D
a  4  40
b  5  50

In [33]:
df1.join(df2)

ValueError: columns overlap but no suffix specified: Index(['A'], dtype='object')

In [34]:
df1.join(df2,lsuffix='_1')#we can give the other name to the left dataframe col which are ovelapping

   A_1   B    A     D
a    1  10  4.0  40.0
b    2  20  5.0  50.0
c    3  30  NaN   NaN

In [36]:
df1.join(df2,rsuffix='_1')#we can give the other name to the left dataframe col which are ovelapping

   A   B  A_1     D
a  1  10  4.0  40.0
b  2  20  5.0  50.0
c  3  30  NaN   NaN